In [1]:
#Importing the needed libraries
import pandas as pd
import numpy as np

In [ ]:
#DataFrame for subjects and marks
data={
    'Subject': [
        'Mathematics',
        'English',
        'Chemistry',
        'Computer Science',
        'History',
        'Physics'
    ],
    'Marks':[
        85,
        92,
        78,
        95,
        88,
        72
    ]
}
#create the DataFrame
marks_df=pd.DataFrame(data)
print(marks_df) #Display the DataFrame

            Subject  Marks
0       Mathematics     85
1           English     92
2         Chemistry     78
3  Computer Science     95
4           History     88
5           Physics     72

In [3]:
#.head() displays the first 5 rows of the dataframe by default
marks_df.head()

            Subject  Marks
0       Mathematics     85
1           English     92
2         Chemistry     78
3  Computer Science     95
4           History     88

In [4]:
#.tail() it displays the last 5 rows of the dataframe by default
marks_df.tail(3)#displa the last 3 rows

            Subject  Marks
3  Computer Science     95
4           History     88
5           Physics     72

In [5]:
#Provides a summary of data types, non-null values and memory usage
marks_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Subject  6 non-null      object
 1   Marks    6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes

In [6]:
#Returns a tuple of rows and columns
marks_df.shape

(6, 2)

In [7]:
#Returns the data type for each column
marks_df.dtypes

Subject    object
Marks       int64
dtype: object

Basic Selection and Slicing

In [8]:
#Selecting a single column
marks_df['Marks']#selects the marks column

0    85
1    92
2    78
3    95
4    88
5    72
Name: Marks, dtype: int64

In [9]:
#Selecting multiple columns
marks_df[['Subject', 'Marks']]

            Subject  Marks
0       Mathematics     85
1           English     92
2         Chemistry     78
3  Computer Science     95
4           History     88
5           Physics     72

In [10]:
#Selecting rows using loc(Label-based indexing) eg to display the second item
row_by_label = marks_df.loc[1]
row_by_label

Subject    English
Marks           92
Name: 1, dtype: object

In [11]:
#Selecting rows using iloc(Integer position indexing)
row_by_position = marks_df.iloc[0]
row_by_position

Subject    Mathematics
Marks               85
Name: 0, dtype: object

In [ ]:
Day 2 I successfully created a DataFrame and can use the essential inspection methods:
-.head()
-.tail()
-.info()
-.shape()
and also being comfortable selecting data using column names and basic indexing(loc/iloc)